In [1]:
import pandas as pd

In [39]:
stocks = pd.read_csv("http://bit.ly/smallstocks")

In [40]:
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [8]:
stocks.groupby('Symbol').Close.mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [9]:
stocks.groupby('Symbol')['Close'].mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [11]:
multi_index_series = stocks.groupby(['Symbol' , 'Date']).Close.mean()
multi_index_series

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [12]:
multi_index_series.index

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

In [18]:
multi_index_series     # this is a series with multi-indexing.

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [19]:
type(multi_index_series)

pandas.core.series.Series

# creating dataframe from a multi-indexed series.

## using series.unstack()
    unstacking means spreading the index and sub-indexes over the rows and columns creating a data frame.

In [60]:
multi_index_series.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

# doing same thing as above with dataframe

## DataFrame.pivot_table(
    values=None,
    index=None,
    columns=None,
    aggfunc='mean',
    fill_value=None,
    margins=False,
    dropna=True,
    margins_name='All',
    observed=False,
)

### pivot_table will create a 2d spreadsheet like table.

### by default it will perform mean() function on given values. values is the column on  which operation to be performed. like here column 'Close' is values.

### to perfom another aggregate function we use aggfunc = 'sum'/'max'...  etc.

In [22]:
df = stocks.pivot_table(index = 'Symbol' , columns = 'Date' , values = 'Close')
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

# 3 layered indexing

In [42]:
stocks2 = pd.read_csv("SampleCsv.csv")

In [43]:
stocks2

        Date   Close    Volume Symbol     Rep
0  10/3/2016   31.50  14070500   CSCO     Ram
1  10/3/2016  112.52  21701800   AAPL     Ram
2  10/3/2016   57.42  19189500   MSFT    Sita
3  10/4/2016  113.00  29736800   AAPL  Ganesh
4  10/4/2016   57.24  20085900   MSFT     Ram
5  10/4/2016   31.35  18460400   CSCO    Sita
6  10/5/2016   57.64  16726400   MSFT    Sita
7  10/5/2016   31.59  11808600   CSCO     Ram
8  10/5/2016  113.05  21453100   AAPL  Ganesh

In [46]:
stocks2.dtypes

Date       object
Close     float64
Volume      int64
Symbol     object
Rep        object
dtype: object

In [48]:
stocks2['Date'] = pd.to_datetime(stocks2['Date'] , format = '%m/%d/%Y')
stocks2

        Date   Close    Volume Symbol     Rep
0 2016-10-03   31.50  14070500   CSCO     Ram
1 2016-10-03  112.52  21701800   AAPL     Ram
2 2016-10-03   57.42  19189500   MSFT    Sita
3 2016-10-04  113.00  29736800   AAPL  Ganesh
4 2016-10-04   57.24  20085900   MSFT     Ram
5 2016-10-04   31.35  18460400   CSCO    Sita
6 2016-10-05   57.64  16726400   MSFT    Sita
7 2016-10-05   31.59  11808600   CSCO     Ram
8 2016-10-05  113.05  21453100   AAPL  Ganesh

In [50]:
mul_index_series2 = stocks2.groupby(['Symbol' , 'Date' , 'Rep']).Close.sum()
mul_index_series2

Symbol  Date        Rep
AAPL    2016-10-03  Ram       112.52
        2016-10-04  Ganesh    113.00
        2016-10-05  Ganesh    113.05
CSCO    2016-10-03  Ram        31.50
        2016-10-04  Sita       31.35
        2016-10-05  Ram        31.59
MSFT    2016-10-03  Sita       57.42
        2016-10-04  Ram        57.24
        2016-10-05  Sita       57.64
Name: Close, dtype: float64

In [51]:
mul_index_series2.unstack()

Rep                Ganesh     Ram   Sita
Symbol Date
AAPL   2016-10-03     NaN  112.52    NaN
       2016-10-04  113.00     NaN    NaN
       2016-10-05  113.05     NaN    NaN
CSCO   2016-10-03     NaN   31.50    NaN
       2016-10-04     NaN     NaN  31.35
       2016-10-05     NaN   31.59    NaN
MSFT   2016-10-03     NaN     NaN  57.42
       2016-10-04     NaN   57.24    NaN
       2016-10-05     NaN     NaN  57.64

## 2 indexes and 1 column view.

In [63]:
df2 = stocks2.pivot_table(
    index = ['Symbol','Rep'] , 
    columns='Date' , 
    values='Close' , 
    aggfunc = 'sum'
    )

df2

Date           2016-10-03  2016-10-04  2016-10-05
Symbol Rep
AAPL   Ganesh         NaN      113.00      113.05
       Ram         112.52         NaN         NaN
CSCO   Ram          31.50         NaN       31.59
       Sita           NaN       31.35         NaN
MSFT   Ram            NaN       57.24         NaN
       Sita         57.42         NaN       57.64

## accessing particular indexes from above dataframe

    1. to group same level indexes we use [].
    
    2. to get values from different multilevel indexes we use ().
    
    3. at most two individual indexes can be passed inside loc.

In [95]:
df2.loc['AAPL' , 'Ram']    

# df2.loc['AAPL' , 'Ram' , ]  ----->  this also works. only two individual indexes


# df2.loc['AAPL' , 'Ram' , :] ----->  this also works. only two individual indexes 
#                                      and column grouped index.


# df2.loc['AAPL' , 'Ram' , '2016-10-04']  ------> Error. as three individual 
#                                                    indexes are given

Date
2016-10-03    112.52
2016-10-04       NaN
2016-10-05       NaN
Name: (AAPL, Ram), dtype: float64

In [105]:
df2.loc[('AAPL' , 'Ram')]   # in this proper grouping of differnt level is done.

Date
2016-10-03    112.52
2016-10-04       NaN
2016-10-05       NaN
Name: (AAPL, Ram), dtype: float64

In [96]:
df2.loc[('AAPL','Ram') , '2016-10-04']

# here also two indexes are there row level = (AAPL , Ram) & column level = 2016-10-04

nan

In [97]:
df2.loc[['AAPL','Ram'] , '2016-10-04']

# this gives wrong ans becoz we have used []. But AAPL and Ram are of different level.

# first it prints data from index AAPL and then Try to search Ram at the same level 
# if found then print else leave.

Symbol  Rep
AAPL    Ganesh    113.0
        Ram         NaN
Name: 2016-10-04 00:00:00, dtype: float64

In [102]:
df2.loc[(['AAPL' , 'MSFT'],'Ram'),]

# df2.loc[(['AAPL' , 'MSFT'],'Ram')] if no comma at the end it gives Error. I don't know
# why.

# May be we should add a comma after a tuple if it is more than 1 dimensional.

Date        2016-10-03  2016-10-04  2016-10-05
Symbol Rep
AAPL   Ram      112.52         NaN         NaN
MSFT   Ram         NaN       57.24         NaN

In [108]:
df2.loc[('AAPL',['Ram','Ganesh']),]

Date           2016-10-03  2016-10-04  2016-10-05
Symbol Rep
AAPL   Ganesh         NaN       113.0      113.05
       Ram         112.52         NaN         NaN

# <font color = RED>Important point.</font>
    
    in the above example we have seen that we have to pass the very first index.
    
    but if we want all the rows from 1st index and few from 2nd. then if we write
    
    DataFrame.loc[: , 'columnName'] -------> this gives error.
    
## in this case we use 
# <font color = GREEN>slice(None)</font>
    
    DataFrame.loc[slice(None) , 'columnName']

In [127]:
# if we want all records for Ram.

# df2.loc[(: ,'Ram'), : ]  ---------> this gives error as ':' doesn't work at starting. 

df2.loc[(slice(None) ,'Ram'), :]

Date        2016-10-03  2016-10-04  2016-10-05
Symbol Rep
AAPL   Ram      112.52         NaN         NaN
CSCO   Ram       31.50         NaN       31.59
MSFT   Ram         NaN       57.24         NaN

## 1 index and two columns views.

In [64]:
df3 = stocks2.pivot_table(
    index = 'Symbol' , 
    columns=['Date' , 'Rep'] , 
    values='Close' , 
    aggfunc = 'sum'
    )

df3

Date   2016-10-03        2016-10-04               2016-10-05
Rep           Ram   Sita     Ganesh    Ram   Sita     Ganesh    Ram   Sita
Symbol
AAPL       112.52    NaN      113.0    NaN    NaN     113.05    NaN    NaN
CSCO        31.50    NaN        NaN    NaN  31.35        NaN  31.59    NaN
MSFT          NaN  57.42        NaN  57.24    NaN        NaN    NaN  57.64